###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ce-epo3-cad.ewi.tudelft.nl)
#  Generated on:      Thu Jan 11 15:11:30 2024
#  Design:            chip_toplevel
#  Command:           saveDesign ../out/chip_toplevel.enc
###############################################################
current_design chip_toplevel
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 30.000000 -waveform {0.000000 15.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {p1_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {p1_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {p1_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {p1_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {p2_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {p2_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {p2_controller}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {p2_controller}]
set_load -pin_load -max  1  [get_ports {controller_latch}]
set_load -pin_load -min  1  [get_ports {controller_latch}]
set_load -pin_load -max  1  [get_ports {controller_clk}]
set_load -pin_load -min  1  [get_ports {controller_clk}]
set_load -pin_load -max  1  [get_ports {Vsync}]
set_load -pin_load -min  1  [get_ports {Vsync}]
set_load -pin_load -max  1  [get_ports {Hsync}]
set_load -pin_load -min  1  [get_ports {Hsync}]
set_load -pin_load -max  1  [get_ports {R_data[3]}]
set_load -pin_load -min  1  [get_ports {R_data[3]}]
set_load -pin_load -max  1  [get_ports {R_data[2]}]
set_load -pin_load -min  1  [get_ports {R_data[2]}]
set_load -pin_load -max  1  [get_ports {R_data[1]}]
set_load -pin_load -min  1  [get_ports {R_data[1]}]
set_load -pin_load -max  1  [get_ports {R_data[0]}]
set_load -pin_load -min  1  [get_ports {R_data[0]}]
set_load -pin_load -max  1  [get_ports {G_data[3]}]
set_load -pin_load -min  1  [get_ports {G_data[3]}]
set_load -pin_load -max  1  [get_ports {G_data[2]}]
set_load -pin_load -min  1  [get_ports {G_data[2]}]
set_load -pin_load -max  1  [get_ports {G_data[1]}]
set_load -pin_load -min  1  [get_ports {G_data[1]}]
set_load -pin_load -max  1  [get_ports {G_data[0]}]
set_load -pin_load -min  1  [get_ports {G_data[0]}]
set_load -pin_load -max  1  [get_ports {B_data[3]}]
set_load -pin_load -min  1  [get_ports {B_data[3]}]
set_load -pin_load -max  1  [get_ports {B_data[2]}]
set_load -pin_load -min  1  [get_ports {B_data[2]}]
set_load -pin_load -max  1  [get_ports {B_data[1]}]
set_load -pin_load -min  1  [get_ports {B_data[1]}]
set_load -pin_load -max  1  [get_ports {B_data[0]}]
set_load -pin_load -min  1  [get_ports {B_data[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {p1_controller}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {p2_controller}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {B_data[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {B_data[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {R_data[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {G_data[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {R_data[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {Hsync}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {G_data[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {Vsync}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {controller_latch}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {controller_clk}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {B_data[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {B_data[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {R_data[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {R_data[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {G_data[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {G_data[0]}]
